<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"ca27d673511141e2ed6a0d691bf256bd1d21585867cfab8f56b627712e254244","plan_job_ref":"Job Staging Image Build & Push #45 at https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439197142","plan_hash":"7c77574c1ec61d5724f5294b4cb3e9fef6e5f8f20e3d000d4cfd4d27e8a949c4","plan_text_format":"diff","version":"1.39.0","closed":true} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 4 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_autoscaling_group.ASG_config will be updated in-place
!~  resource "aws_autoscaling_group" "ASG_config" {
+       desired_capacity_type            = "units"
        id                               = "fastapi-ASG-dev"
        name                             = "fastapi-ASG-dev"
#        (26 unchanged attributes hidden)

!~      launch_template {
!~          id   = "********************" -> (known after apply)
            name = "LaunchTemplateECR"
        }

#        (3 unchanged blocks hidden)
    }

  # aws_ecs_cluster_capacity_providers.Provider_config will be created
+   resource "aws_ecs_cluster_capacity_providers" "Provider_config" {
+       capacity_providers = [
+           "CustomEC2Provider",
        ]
+       cluster_name       = "fastapi-cluster"
+       id                 = (known after apply)

+       default_capacity_provider_strategy {
+           base              = 1
+           capacity_provider = "CustomEC2Provider"
+           weight            = 100
        }
    }

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       force_new_deployment               = true
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "EC2"
+       name                               = "dev-fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = {
+           "Environment" = "Dev Environment"
        }
+       task_definition                    = (known after apply)
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       load_balancer {
+           container_name   = "dev_FastAPI_image"
+           container_port   = 5000
+           target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:806066816337:targetgroup/alb-target-group-dev/3c273cd8ab1a4464"
        }
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
!~      arn                      = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container:37" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:eu-central-1:806066816337:task-definition/dev-fastapi-container" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   environment  = []
!~                  image        = "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:a02564d370404ad0b4f9c1c8e2a91c1e612b30bf" -> "public.ecr.aws/p2x0k5a9/dev/irezd/fastapi:093209d8383eccc983e5bc2354b3e6419ad869a0"
-                   mountPoints  = []
                    name         = "dev_FastAPI_image"
!~                  portMappings = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   volumesFrom  = []
#                    (3 unchanged attributes hidden)
                },
            ] # forces replacement
        )
!~      id                       = "*********************" -> (known after apply)
+       network_mode             = (known after apply)
!~      revision                 = 37 -> (known after apply)
-       tags                     = {} -> null
#        (4 unchanged attributes hidden)
    }

  # aws_launch_template.ASG_template will be created
+   resource "aws_launch_template" "ASG_template" {
+       arn             = (known after apply)
+       default_version = (known after apply)
+       id              = (known after apply)
+       image_id        = (sensitive value)
+       instance_type   = "t2.micro"
+       latest_version  = (known after apply)
+       name            = (known after apply)
+       name_prefix     = "LaunchTemplateECR"
+       tags_all        = {
+           "Environment" = "Dev Environment"
        }

+       iam_instance_profile {
+           name = "InstanceRoleForECS"
        }

+       network_interfaces {
+           associate_public_ip_address = "true"
+           security_groups             = [
+               "sg-091e964d65dee5150",
            ]
        }
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Staging Image Build & Push #45](https://github.com/IrezD/python-fastAPI-docker-image-v2/actions/runs/7439197142)
<details open><summary>Outputs</summary>

```hcl
ecr_registry_id     = "806066816337"
ecr_repository_name = "dev/irezd/fastapi"
```
</details>